# FabricationConfiguration Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalResourceTypes..::..BuiltInExternalResourceTypes..::..FabricationConfiguration Property
ExternalResourceTypes..::..BuiltInExternalResourceTypes Class See Also
---
An external resource type representing an MEP fabrication configuration.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ExternalResourceType FabricationConfiguration { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FabricationConfiguration As ExternalResourceType
	Get
```

Visual C++
---
```text
public:
static property ExternalResourceType^ FabricationConfiguration {
	ExternalResourceType^ get ();
}
```

# See Also
ExternalResourceTypes..::..BuiltInExternalResourceTypes Class
Autodesk.Revit.DB Namespace